In [1]:
import pandas as pd
import numpy as np

In [2]:
a_list = [3, 217, 182]

In [3]:
a_index = ['a','b','c']

In [4]:
a_no_index= pd.Series(a_list, index=a_index)
a_no_index

a      3
b    217
c    182
dtype: int64

In [5]:
a = pd.Series(a_list)
a

0      3
1    217
2    182
dtype: int64

In [6]:
b_dict = {'cat': 'Gorefield', 'Dog': 'Smiley', 'Fish': 'Scales'}
b_dict

{'cat': 'Gorefield', 'Dog': 'Smiley', 'Fish': 'Scales'}

In [7]:
b = pd.Series(b_dict)
b

cat     Gorefield
Dog        Smiley
Fish       Scales
dtype: object

In [8]:
data = {
    "product_num": [1658, 2476, 3911],
    "quantity": [120, 54, 98]
}

In [9]:
df = pd.DataFrame(data)
print(df)

   product_num  quantity
0         1658       120
1         2476        54
2         3911        98

In [10]:
df

   product_num  quantity
0         1658       120
1         2476        54
2         3911        98

In [11]:
df.to_string()

'   product_num  quantity\n0         1658       120\n1         2476        54\n2         3911        98'

In [12]:
df01 = pd.DataFrame((1,2,3,4))
df01

   0
0  1
1  2
2  3
3  4

In [14]:
arr = np.array([5,6,7,8])
df02 = pd.DataFrame(arr)
df02

   0
0  5
1  6
2  7
3  8

In [15]:
ser = pd.Series(arr)
df03 = pd.DataFrame(ser)
df03

   0
0  5
1  6
2  7
3  8

In [19]:
arr2 = np.array([[1,2,3,4]])
df04 = pd.DataFrame(arr2)
df04

   0  1  2  3
0  1  2  3  4

In [21]:
df04.insert(2, 'A', ['a']) 
df04

   0  1  A  2  3
0  1  2  a  3  4

In [ ]:
# [DataFrame Name].inster(index, column name, record data)

In [22]:
df04.insert(5, 'D', ['d'])
df04

   0  1  A  2  3  D
0  1  2  a  3  4  d

In [23]:
sampledata = pd.DataFrame(np.arange(8).reshape((2,4)), index=['apple', 'banana'], columns=['a', 'b', 'c', 'd'])
sampledata

        a  b  c  d
apple   0  1  2  3
banana  4  5  6  7

In [ ]:
# Index applies to the rows. Columns applies to the columns

In [24]:
sampledata_default = pd.DataFrame(np.arange(8).reshape((2,4)))
sampledata_default

   0  1  2  3
0  0  1  2  3
1  4  5  6  7